HCHCHC99/rtt_hc32f460/RTT_template/Adp/hc32_drv_gpio.c
#include "hc32_drv_gpio.h"
#include "hc32_ll_gpio.h"
#include "hc32_ll_utility.h"


/* 修改后的函数 */
void Output_GPIO_Init(uint8_t u8Port, uint16_t u16Pin, en_gpio_init_state_t enInitState)
{
    stc_gpio_init_t stcGpioInit;

    /* 初始化GPIO结构体为默认值 */
    GPIO_StructInit(&stcGpioInit);

    /* 配置为输出模式 */
    stcGpioInit.u16PinDir         = PIN_DIR_OUT;      /* 输出方向 */
    stcGpioInit.u16PinState       = PIN_STAT_RST;     /* 初始状态为低电平 */
    stcGpioInit.u16PinOutputType  = PIN_OUT_TYPE_CMOS;/* 推挽输出 */
    stcGpioInit.u16PinDrv         = PIN_HIGH_DRV;     /* 高驱动能力 */
    stcGpioInit.u16PullUp         = PIN_PU_OFF;       /* 无上拉 */
    stcGpioInit.u16Invert         = PIN_INVT_OFF;     /* 不翻转 */
    stcGpioInit.u16Latch          = PIN_LATCH_OFF;    /* 无锁存 */
    stcGpioInit.u16ExtInt         = PIN_EXTINT_OFF;   /* 不使用外部中断 */
    stcGpioInit.u16PinAttr        = PIN_ATTR_DIGITAL; /* 数字功能 */

    /* 初始化GPIO引脚 */
    GPIO_Init(u8Port, u16Pin, &stcGpioInit);

    /* 设置引脚功能为GPIO功能（FUNC_0表示普通GPIO） */
    GPIO_SetFunc(u8Port, u16Pin, GPIO_FUNC_0);

    /* 使能输出 */
    GPIO_OutputCmd(u8Port, u16Pin, ENABLE);

    /* 根据枚举参数设置初始输出状态 */
    if (enInitState == GPIO_INIT_HIGH) {
        GPIO_SetPins(u8Port, u16Pin);   /* 初始高电平 */
    } else {
        GPIO_ResetPins(u8Port, u16Pin); /* 初始低电平 */
    }
}

/**
 * @brief 通用GPIO输入初始化函数
 * @param u8Port: 端口号
 * @param u16Pin: 引脚号
 * @param enablePullUp: 是否使能上拉电阻
 * @retval None
 */
void Input_GPIO_Init(uint8_t u8Port, uint16_t u16Pin, en_functional_state_t enablePullUp)
{
    stc_gpio_init_t stcGpioInit;

    /* 初始化GPIO结构体为默认值 */
    GPIO_StructInit(&stcGpioInit);

    /* 配置为输入模式 */
    stcGpioInit.u16PinDir         = PIN_DIR_IN;       /* 输入方向 */
    stcGpioInit.u16PullUp         = (enablePullUp == ENABLE) ? PIN_PU_ON : PIN_PU_OFF;
    stcGpioInit.u16PinAttr        = PIN_ATTR_DIGITAL; /* 数字功能 */
    stcGpioInit.u16ExtInt         = PIN_EXTINT_OFF;   /* 不使用外部中断 */

    /* 初始化GPIO引脚 */
    GPIO_Init(u8Port, u16Pin, &stcGpioInit);

    /* 设置引脚功能为GPIO功能 */
    GPIO_SetFunc(u8Port, u16Pin, GPIO_FUNC_0);
}

